{"word": "fly", "id": "4341", "pronunciation": {"美": "[flaɪ]", "英": "[flaɪ]"}, "paraphrase": ["vi. 飞；驾驶飞机；飘扬", "vt. 飞行；飞越；使飘扬", "n. 飞行；苍蝇；两翼昆虫", "adj. 敏捷的", "n. (Fly)人名；(法)弗利；(英)弗莱"], "rank": "CET4 TEM4", "pattern": "( flying, flew, flown, flies )", "sentence": [["A fly is a small insect with two wings. There are many kinds of flies, and the most common are black in colour. 苍蝇", "N-COUNT", [["Flies buzzed at the animals' swishing tails.", "苍蝇在动物甩动的尾巴边嗡嗡叫。"]]], ["a lure made from a fish-hook dressed with feathers, tinsel, etc, to resemble any of various flies or nymphs: used in fly-fishing (“飞蝇钓法”中使用的)假蝇鱼饵 → see also ,", "[angling]", []], ["The front opening on a pair of trousers is referred to as the fly. It usually consists of a zipper or row of buttons behind a band of cloth. 裤子的前开口", "N-COUNT", [["I'm the kind of person who checks to see if my fly is undone.", "我是那种会检查裤前拉链是否拉上的人。"]]], ["a flap forming the entrance to a tent 帐篷门帘", "N", []], ["a piece of canvas drawn over the ridgepole of a tent to form an outer roof 帐篷的外层帆布帐顶", "N", []], ["the space above the stage out of view of the audience, used for storing scenery, etc (不在观众视野内、用于存放舞台布景等的)舞台上部空间", "[theatre]", []], ["When something such as a bird, insect, or aircraft flies, it moves through the air. 飞", "V-I", [["The planes flew through the clouds.", "飞机穿越云层。"]]], ["If you fly somewhere, you travel there in an aircraft. 乘飞机", "V-I", [["He flew to Los Angeles.", "他乘飞机去洛杉矶。"], ["He flew back to London.", "他乘飞机回到伦敦。"]]], ["When someone flies an aircraft, they control its movement in the air. 驾驶 (飞机); 驾驶飞机", "V-T/V-I", [["Parker had successfully flown both aircraft.", "帕克成功地驾驶过这两架飞机。"], ["He flew a small plane to Cuba.", "他驾驶一架小飞机去古巴。"], ["I learned to fly in Vietnam.", "我在越南学会了驾驶飞机。"]]], ["flying 飞行", "N-UNCOUNT", [["...a flying instructor.", "…一名飞行教练。"]]], ["To fly someone or something somewhere means to take or send them there in an aircraft. 空运", "V-T", [["It may be possible to fly the women and children out on Thursday.", "周四有可能将这些妇女和儿童空运出去。"]]], ["If something such as your hair is flying about, it is moving about freely and loosely in the air. 飞舞", "V-I", [["His long, uncovered hair flew back in the wind.", "他那无遮盖的长发随风向后飞舞。"]]], ["If you fly a flag or if it is flying, you display it at the top of a pole. 升 (旗); 飘扬", "V-T/V-I", [["They flew the flag of the African National Congress.", "他们挥动着非洲国民大会的旗帜。"]]], ["If you say that someone or something flies in a particular direction, you are emphasizing that they move there with a lot of speed or force. 飞奔", "[强调]", [["She flew to their bedsides when they were ill.", "她在他们生病时飞奔到他们的床边。"]]], ["knowing and sharp; smart 博学而敏锐的; 聪明的", "[英国英语]", []], ["furtive or sneaky 鬼祟的", "[SCOTTISH]", []], ["→ see also", "", []], ["If you say that someone wouldn't hurt a fly or wouldn't harm a fly, you are emphasizing that they are very kind and gentle. “连一只苍蝇都不愿伤害”指“温柔、善良”", "[强调]", [["Ray wouldn't hurt a fly.", "雷很温柔善良。"]]], ["If you let fly, you attack someone, either physically by hitting them, or with words by insulting them. 攻击", "PHRASE", [["A simmering dispute ended with her letting fly with a stream of obscenities.", "一次激烈的争吵以她那一连串污言秽语的攻击告终。"]]], ["If you send someone or something flying or if they go flying, they move through the air and fall down with a lot of force. 把 (某人/某物) 打翻在地", "PHRASE", [["The blow sent the young man flying.", "那一击将那年轻人打翻在地。"]]], ["If you do something on the fly, you do it quickly or automatically, without planning it in advance. 立刻; 飞快", "[v PHR]", [["You've got to be able to make decisions on the fly as deadlines loom.", "你必须能够立刻作出决定，因为最后期限迫在眉睫。"]]], ["a flap forming the entrance to a tent", "N", []], ["to fly in the face of →see", "", []], ["to fly off the handle →see", "", []], ["a fly in the ointment →see", "", []], ["when pigs fly →see", "", []], ["sparks fly →see", "", []], ["time flies →see", "", []]]}
